local function run(msg)
if msg.text == "help pv" or "Help pv" and is_owner(msg) then
 return "
دستورات گروه\n

!kick [ایدی فرد و یا ریپلی پیام او]\n
کیک کردن فردی\n

!ban [ایدی فرد و یا ریپلی پیام او]\n
کیک دائمی فردی\n

!unban [ایدی فرد و یا ریپلی پیام او]\n
خلاص شدن از کیک دائمی فردی.\n

!who\n
لیست اعضا\n

!modlist\n
لیست مدیران گروه\n

!sticker warn\n
فردی که استیکر ارسال کند ابتدا اخطار میگیرد وقتی تکرار کند کیک میشود\n

!sticker kick\n
فردی که استیکر ارسال کند کیک میشود\n

!sticker ok\n
غیرفعال کردن استیکر ممنوع\n

!promote [ایدی فرد و یا ریپلی پیام او]\n
اضافه کردن مدیری به گروه\n

!demote [ایدی فرد و یا ریپلی پیام او.]\n
حذف کردن فردی از مدیریت در گروه\n

!kickme\n
خروج از گروه\n

!bot +\n
فعال شدن ضدربات\n

!bot -\n
غیرفعال شدن ضدربات\n

!loc [نام منطقه]\n
گرفتن اطلاعات درباره منطقه ای\n

!support\n
ورود به گروه پشتیبانی\n

!dic [متن]\n
ترجمه متن شما از انگلیسی به فارسی\n

!dic [زبان مورد نظر][متن]\n
ترجمه متن شما به زبان دلخواهتون\n

!about\n
درباره گروه\n

!info \n
با فرستادن این دستور اطلاعات خود و با ریپلی کردن پیام فردی اطلاعات اورا نشان میدهد.\n

!webshot [ادرس سایت]\n
دریافت عکسی از صفحه سایت مورد نظر \n

!time [نام منطقه]\n
دریافت موقعیت زمانی منطقه ای\n

!setrank [ایدی فرد]\n
با این دستور میتواند به فردی در اینفو مقام دهید\n

!setphoto\n
تنظیم عکس  و قفل کردن ان\n

!setname [نام]\n
تنظیم نام گروه به : نام\n

!rules\n
قوانین گروه\n

!id\n
ایدی گروه و با ریپلی کردن پیام فردی ایدی او را نشان میدهد\n

!lock [member|name|bots|leave]	\n
بستن : اعضا - نام - ورود ربات ها - خروج اعضا\n

!unlock [member|name|bots|leave]\n
بازکردن : اعضا - نام - ورود ربات ها - خروج اعضا\n

!set rules <متن>\n
تنظیم قوانین گروه به : متن\n

!set about <متن>\n
تنظیم درباره گروه به : متن\n

!settings\n
تنظیمات گروه\n

addadmin\n
اضافه شدن مدیر به گروه\n

!newlink\n
لینک جدید\n

!link\n
لینک گروه\n

!owner\n
ایدی صاحب گروه\n

!setowner [ایدی فرد و یا ریپلی پیام او]\n
تنظیم صاحب گروه\n

!setflood [عدد]\n
تنظیم مقدار اسپم: میتواند از عدد 1 شروع شود\n

!stats\n
نمایش تعداد پیام ها\n

!save [نام دستور] <متن>\n
ساختن دستور جدید : نام دستور - متن\n

!get [نام دستور]\n
دریافن دستور\n

!clean [modlist|rules|about]\n
پاک کردن : لیست مدیران - قوانین - درباره گروه\n

!res [username]\n
دریافت نام و ایدی فردی. مثال👇🏻\n
"!res @Mr_Vigeo"\n

!log\n
دریافت ورودی های گروه\n

!banlist\n
لیست افراد بن شده\n
\n\n\n
شما میتوانید از دستورات زیر استفاده کنید👇🏻\n
"!" "/" "#" "@" "$"\n\n
سازنده : @Mr_Vigeo\n
ورژن ربات: 1.5
"

end
end

return {
 description = "help pv", 
 usage = "help pv",
 patterns = {
  "^[Hh]elp pv$",
}, 
 run = run,
 pre_process = pre_process
}
